firstCrude2D/we123/h10_refined2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       114720;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       114840;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       114960;
    }
    atmosphere
    {
        type            patch;
        nFaces          480;
        startFace       115200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          115200;
        startFace       115680;
    }
)

// ************************************************************************* //
